# Homebrew Bundle 清单
# 安装：brew bundle --file=~/code/dotfiles/Brewfile

# --- Tap 源 ---
tap "homebrew/cask-fonts"

# --- 终端与命令行 ---
brew "zsh"
brew "tmux"

# --- 版本控制 ---
brew "git"
brew "gh"
brew "lazygit"

# --- Jujutsu（jj）---
brew "jj"
brew "jjui"

# --- CLI 工具 ---
brew "eza"                   # 现代版 ls
brew "bat"                   # 现代版 cat
brew "fd"                    # 现代版 find
brew "ripgrep"               # 现代版 grep
brew "tree"
brew "jq"
brew "zoxide"                # 智能 cd
brew "trash"                 # 安全删除
brew "git-delta"             # 更好的 diff

# --- 语言与运行时 ---
brew "go"
brew "node"
brew "ruby"
brew "rust"

# --- 杂项 ---
brew "yt-dlp"
brew "cloudflared"
brew "duti"

# --- Cask：应用 ---
cask "ghostty@tip"
cask "google-chrome"
cask "visual-studio-code"
cask "cursor"
cask "zed"
cask "notion"
cask "raycast"
cask "karabiner-elements"
cask "mos"
cask "betterdisplay"
cask "itsycal"
cask "localsend"
cask "shottr"
cask "snipaste"
cask "spotify"
cask "telegram"
cask "tailscale"
cask "libreoffice"
cask "warp"
cask "stats"
cask "mitmproxy"

# --- Cask：字体 ---
cask "font-geist"
cask "font-geist-mono"
cask "font-commit-mono"
cask "font-inter"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-lilex"
cask "font-ibm-plex-sans"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-sarasa-gothic"
cask "font-work-sans"
cask "font-roboto-mono"
cask "font-spectral"
